# Перепишіть за допомогою функцій вашу программу "Касир в кінотеатрі", яка буде виконувати наступне:
# Попросіть користувача ввести свсвій вік.
# - якщо користувачу менше 7 - вивести "Тобі ж <> <>! Де твої батьки?"
# - якщо користувачу менше 16 - вивести "Тобі лише <> <>, а це е фільм для дорослих!"
# - якщо користувачу більше 65 - вивести "Вам <> <>? Покажіть пенсійне посвідчення!"
# - якщо вік користувача містить 7 - вивести "Вам <> <>, вам пощастить"
# - у будь-якому іншому випадку - вивести "Незважаючи на те, що вам <> <>, білетів всеодно нема!"
# Замість <> <> в кожну відповідь підставте значення віку (цифру) та правильну форму слова рік.
# Для будь-якої відповіді форма слова "рік" має відповідати значенню віку користувача
# (1 - рік, 22 - роки, 35 - років і тд...). Наприклад :

def result_info(age):
    result = str(age).find('7')
    years = None
    first_data = (11, 12, 13, 14)
    second_data = (5, 6, 7, 8, 9, 0)
    third_data = (2, 3, 4)

    if len(str(age)) > 1 and age % 100 in first_data or age % 10 in second_data:
        years = 'років'
    elif age % 10 == 1:
        years = 'рік'
    elif age % 10 in third_data:
        years = 'роки'

    if age < 7 and result == -1:
        return (f'Тобі ж {age} {years}! Де твої батьки?')
    elif age < 16 and result == -1:
        return (f'Тобі лише {age} {years}, а це фільм для дорослих!')
    elif age > 65 and result == -1:
        return (f'Вам {age} {years}? Покажіть пенсійне посвідчення!')
    elif result != -1:
        return (f'Вам {age} {years}, вам пощастить!')
    else:
        return (f'Незважаючи на те, що вам {age} {years}, білетів все одно нема!')

print(result_info(int(input('Введить свій вік '))))